страна_континент('Русия','Европа').
страна_континент('Русия','Азия').
страна_континент('Франция','Европа').
страна_континент('Япония','Азия').
страна_континент('България','Европа').
страна_континент('Египет','Африка').
страна_континент('САЩ','Северна Америка').
страна_континент('Бразилия','Южна Америка').
страна_континент('Германия','Европа').
страна_континент('Естония','Европа').
страна_континент('Китай','Азия').
столица_страна('Талин','Естония').
столица_страна('Москва','Русия').
столица_страна('Париж','Франция').
столица_страна('Токио','Япония').
столица_страна('София','България').
столица_страна('Кайро','Египет').
столица_страна('Вашингтон','САЩ').
столица_страна('Бразилия','Бразилия').
столица_страна('Берлин','Германия').
столица_страна('Пекин','Китай').
град_население('София',1850000).
град_население('Токио',7500500).
град_население('Москва',21000300).
град_население('Париж',6600500).
град_население('Берлин',9000888).
град_население('Пловдив',550000).
град_население('Силистра',95000).
град_население('Карнобат',95000).
град_население('Хамбург',210000).
град_население('Санкт Петербург',4500001).
град_население('Монтана',33500).
град_население('Лос Анджелис',4500000).
град_население('Нагасаки',500000).


%Задача 2

f(X,Result):-

1 >= X , X \== -1,

Result is log(abs(X+1)).

f(X,Result):-

1 < X, X \== 5,

Result is X**3+3/X.

f(X,Result):- (X == -1 ; X ==5),
    
Result =X.
% -------------------------------
/**
 * Задача 2:
 * ?- f(1,0.69314718055994530941723212145818).
 * ?- f(3,28).
 * ?- f(-1,-1).
 * 
 * 
 * 
 * 
 * 
 */


/** <examples>
 * Задача 1:
 * 1.България в Европа ли е?
?- страна_континент('България','Европа').
  2.На кой континент е Русия? 
?- страна_континент('Русия',X).\
 3.Кои са страните в Европа?
?- страна_континент(X,'Европа').
 4.Кои са европейските столици?
?- столица_страна(X,Y),страна_континент(Y,Z),Z=='Европа',projection([X])
 5.Кои са градовете с население над 3 млн.?
?- град_население(X,Y),Y>3000000,projection([X]).
  6.Кои са столиците с население над 7 млн.?
?- столица_страна(X,Y),град_население(X,Z),Z>7000000,projection([X]).
  7.Кои са столиците в Европа с население над 7млн.? 
(Да се изведат само столиците като списък)
?- страна_континент(Y,P),столица_страна(X,Y),град_население(X,Z),Z>7000000,P=='Европа',projection([]),write(X).
  8.Има ли два града с еднакъв брой жители?
?- град_население(X,Y),град_население(A,B),Y==B,X\==A,projection([]),!.
  9.Кои са континентите, в които има страни със столица над 4 млн. жители?
?- страна_континент(Y,P),столица_страна(X,Y),град_население(X,Z),Z>4000000,projection([P]).
  10.Кои са градовете, които не са  столица на някоя страна?
?- град_население(X,G),not(столица_страна(X,_)),projection([X]).
  11.Кой е града с най-малко население?
?- град_население(X,Y),\+ (град_население(_,Z),Z<Y),projection([X]).
  12.Коя е столицата с най-много жители?
?- столица_страна(X,P),град_население(X,Y),\+ (град_население(_,Z),Z>Y),projection([X]).
*/